```
krishna@turbotindias-MacBook-Pro gcp_check_stack % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_project_pubsub_stack[0] will be created
  + resource "turbot_policy_setting" "gcp_project_pubsub_stack" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp#/policy/types/projectStack"
      + value                        = "Check: Configured"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_project_pubsub_stack_source[0] will be created
  + resource "turbot_policy_setting" "gcp_project_pubsub_stack_source" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp#/policy/types/projectStackSource"
      + value                        = <<~EOT
            resource "google_pubsub_topic" "turbot_test_demo" {
              name = "turbot_test_demo_topic"
            }
            
            resource "google_pubsub_subscription" "turbot_test_demo" {
              name  = "turbot_test_demo_subscription"
              topic = "${google_pubsub_topic.turbot_test_demo.name}"
              message_retention_duration = "1000s"
              retain_acked_messages = true
              ack_deadline_seconds = 20
            
              expiration_policy {
                ttl = "300000.5s"
              }
            }
            
            resource "google_pubsub_topic_iam_member" "pubsubpublisher" {
                  topic = "${google_pubsub_topic.turbot_test_demo.name}"
                  role   = "roles/pubsub.publisher"
                  member = "allAuthenticatedUsers"
            }
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_project_pubsub_stack_tfversion[0] will be created
  + resource "turbot_policy_setting" "gcp_project_pubsub_stack_tfversion" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp#/policy/types/projectStackTerraformVersion"
      + value                        = "0.12.*"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_stack will be created
  + resource "turbot_smart_folder" "gcp_stack" {
      + description = "Defines sets of policies for the GCP Stack baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Stack Example Policies"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gcp_project_pubsub_stack_policies           = true
  + gcp_project_pubsub_stack_source_policies    = true
  + gcp_project_pubsub_stack_tfversion_policies = true
  + smart_folder_description                    = "Defines sets of policies for the GCP Stack baseline"
  + smart_folder_name                           = "GCP Stack Example Policies"
  + smart_folder_parent_resource                = "tmod:@turbot/turbot#/"
  + turbot_profile                              = "punisher"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_stack: Creating...
turbot_smart_folder.gcp_stack: Creation complete after 1s [id=216719315161771]
turbot_policy_setting.gcp_project_pubsub_stack[0]: Creating...
turbot_policy_setting.gcp_project_pubsub_stack_source[0]: Creating...
turbot_policy_setting.gcp_project_pubsub_stack_tfversion[0]: Creating...
turbot_policy_setting.gcp_project_pubsub_stack_source[0]: Creation complete after 2s [id=216719317710080]
turbot_policy_setting.gcp_project_pubsub_stack_tfversion[0]: Creation complete after 2s [id=216719317647599]
turbot_policy_setting.gcp_project_pubsub_stack[0]: Creation complete after 2s [id=216719317632232]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

gcp_project_pubsub_stack_policies = true
gcp_project_pubsub_stack_source_policies = true
gcp_project_pubsub_stack_tfversion_policies = true
smart_folder_description = Defines sets of policies for the GCP Stack baseline
smart_folder_name = GCP Stack Example Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher